adapter
caffeine
evernote
iterm2-beta
nvalt
sourcetree
transmission
adium
calibre
gfxcardstatus
latexit
scummvm
spectacle-lion
truecrypt
android-file-transfer
cyberduck
google-chrome
libreoffice
seashore
spotify
unison
battery-time-remaining
day-o
inkscape
mactex
skype
textwrangler
vlc
bibdesk
dropbox
istumbler
mediainfo
smcfancontrol
todoist
