# brew tap
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# brew install
brew "coreutils"
brew "exiftool"
brew "ffmpeg"
brew "fontconfig"
brew "gettext"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "gpg"
brew "macvim"
brew "mackup"
brew "mas"
brew "ollama"
brew "pandoc"
brew "peco"
brew "pyenv"
brew "ripgrep"
brew "rsync"
brew "ssh-copy-id"
brew "tectonic"
brew "tree"
brew "wget"
brew "yt-dlp"
brew "zsh"

# brew cask install
cask "adapter"
cask "calibre"
cask "docker"
cask "dropbox"
cask "gimp"
cask "google-chrome"
cask "iterm2"
cask "itsycal"
cask "mactex"
cask "miniconda"
cask "mkvtoolnix"
cask "obsidian"
cask "protonvpn"
cask "rectangle"
cask "skype"
cask "slack"
cask "soulseek"
cask "sourcetree"
cask "spotify"
cask "stats"
cask "telegram"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# brew cask install fonts
cask "font-domine"
cask "font-fira-code-nerd-font"
cask "font-public-sans"
cask "font-fira-mono"
cask "font-raleway"
cask "font-fira-mono-for-powerline"
cask "font-raleway-dots"
cask "font-fira-sans"
cask "font-source-code-pro"
cask "font-academicons"
cask "font-fjalla-one"
cask "font-source-code-pro-for-powerline"
cask "font-alegreya"
cask "font-fontawesome"
cask "font-alegreya-sans"
cask "font-inconsolata"
cask "font-alfa-slab-one"
cask "font-inconsolata-dz-for-powerline"
cask "font-tex-gyre-pagella"
cask "font-antic-slab"
cask "font-lato"
cask "font-tex-gyre-pagella-math"
cask "font-awesome-terminal-fonts"
cask "font-montserrat"
cask "font-bitter"
cask "font-montserrat-subrayada"
cask "font-crimson-text"
cask "font-open-sans"

# mas
mas "Amphetamine", id: 937984704
mas "BBEdit", id: 404009241
mas "Bitwarden", id: 1352778147
mas "Drafts", id: 1435957248
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
mas "WhatsApp", id: 310633997

# VSCode
vscode "alefragnani.bookmarks"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "charliermarsh.ruff"
vscode "chrischinchilla.vscode-pandoc"
vscode "dhoeric.ansible-vault"
vscode "dracula-theme.theme-dracula"
vscode "gitlab.gitlab-workflow"
vscode "hbenl.vscode-test-explorer"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "msjsdiag.vscode-react-native"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "tamasfe.even-better-toml"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
